app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'Approved'
SELECT COUNT(*) AS `numrows`
FROM `vehicles`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data['total_pending'] = $db->table('bookings')->where('status', 'Pending')->countAllResults();
        $data['total_approved'] = $db->table('bookings')->where('status', 'Approved')->countAllResults();
        $data['total_vehicle'] = $db->table('vehicles')->countAllResults();