app/Controllers/Driver.php

SELECT *
FROM `drivers`
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Driver',
            'drivers' => $this->driverModel->findAll()