app/Controllers/Region.php

    public function index() {
        $data = [
            'title'   => 'Daftar Wilayah (Regions)',
            'regions' => $this->regionModel->findAll()
---
SELECT *
FROM `regions`