app/Controllers/Vehicle.php

SELECT *
FROM `vehicle_logs`
---
    public function index()
    {
        $vehicleLogModel = new \App\Models\VehicleLogModel();

        $data = [
            'title' => 'Daftar Kendaraan',
            'vehicles' => $this->vehicleModel->getVehicles(),
            'vehicle_logs' => $vehicleLogModel->findAll()
        ];

SELECT *
FROM `vehicle_logs`
WHERE `vehicle_id` = '1'
ORDER BY `date_logged` DESC
SELECT `bookings`.*, `drivers`.`name` as `driver_name`
FROM `bookings`
JOIN `drivers` ON `drivers`.`id` = `bookings`.`driver_id`
WHERE `vehicle_id` = '1'
AND `bookings`.`status` = 'Approved'
---
    public function detail($id)
    {
        $vehicleLogModel = new \App\Models\VehicleLogModel();
        $bookingModel = new \App\Models\BookingModel();

        $data = [
            'vehicle' => $this->vehicleModel->getVehiclesById($id),
            'logs' => $vehicleLogModel->where('vehicle_id', $id)->orderBy('date_logged', 'DESC')->findAll(),
            'usage_history' => $bookingModel->select('bookings.*, drivers.name as driver_name')
                ->join('drivers', 'drivers.id = bookings.driver_id')
                ->where('vehicle_id', $id)
                ->where('bookings.status', 'Approved')
                ->findAll()