app/Models/BookingModel.php

SELECT `bookings`.*, `vehicles`.`model` as `vehicle_name`, `drivers`.`name` as `driver_name`, `u1`.`username` as `approver_1`, `u2`.`username` as `approver_2`, `users`.`username` as `username`
FROM `bookings`
LEFT JOIN `vehicles` ON `vehicles`.`id` = `bookings`.`vehicle_id`
LEFT JOIN `drivers` ON `drivers`.`id` = `bookings`.`driver_id`
LEFT JOIN `users` ON `users`.`id` = `bookings`.`user_id`
LEFT JOIN `users` `u1` ON `u1`.`id` = `bookings`.`approver_1_id`
LEFT JOIN `users` `u2` ON `u2`.`id` = `bookings`.`approver_2_id`
WHERE   (
`approver_1_id` = '3'
OR `approver_2_id` = '3'
 )
---
    public function getFullBookingData()
    {
        return $this->select('bookings.*, vehicles.model as vehicle_name, drivers.name as driver_name, u1.username as approver_1, u2.username as approver_2, users.username as username')
            ->join('vehicles', 'vehicles.id = bookings.vehicle_id', 'left')
            ->join('drivers', 'drivers.id = bookings.driver_id', 'left')
            ->join('users', 'users.id = bookings.user_id', 'left')
            ->join('users u1', 'u1.id = bookings.approver_1_id', 'left')
            ->join('users u2', 'u2.id = bookings.approver_2_id', 'left')
            ->findAll();