app/Models/VehicleModel.php

SELECT `vehicles`.*, `regions`.`name` as `region_name`
FROM `vehicles`
LEFT JOIN `regions` ON `regions`.`id` = `vehicles`.`region_id`
---
    public function getVehicles()
    {
        // Melakukan join agar kita bisa mengambil nama wilayah
        return $this->select('vehicles.*, regions.name as region_name')
            ->join('regions', 'regions.id = vehicles.region_id', 'left')
            ->findAll();

SELECT `vehicles`.*, `regions`.`name` as `region_name`
FROM `vehicles`
LEFT JOIN `regions` ON `regions`.`id` = `vehicles`.`region_id`
WHERE `vehicles`.`id` = '1'
---
    public function getVehiclesById($id)
    {
        return $this->select('vehicles.*, regions.name as region_name')
            ->join('regions', 'regions.id = vehicles.region_id', 'left')
            ->find($id);